import numpy as np

#（1）创建一维数组 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]，提取其中的奇数，以一维数组输出
a1 = np.arange(10)
a1odd = np.array([_ for _ in a1 if (_ % 2 != 0)])
print('(1)\n', a1odd)

#（2）创建二维数组 [[0, 1, 2], [3, 4, 5], [6, 7, 8]]，并交换第0行和第1行的内容，输出该新数组（得到 [[3, 4, 5], [0, 1, 2], [6, 7, 8]]）
a2 = np.arange(9).reshape(3, 3)
a2[[0,1],:]=a2[[1,0],:]
print('(2)\n', a2)

#（3）创建包含1到10之间随机取值的二维数组，数组大小为3x4，输出数组和它的最大值、最小值、平均值
a3 = np.random.randint(0, 10, (3,4))
print('(3)\n', a3, '\n', a3.max(), a3.min(), a3.mean())

#（4）创建一个5x5的二维数组，其中边界值为1，其余值为0。将该变量以.npy形式保存至本地
a4 = np.ones((5, 5))
a4[1:-1,1:-1] = 0
np.save ('a4.npy', a4)
print('(4)\n', a4)